# Database Admin 101 - Lab

## Introduction 

In this lab, you'll go through the process of designing and creating a database. From there, you'll begin to populate this table with mock data provided to you.

## Objectives

You will be able to:

* Use knowledge of the structure of databases to create a database and populate it

## The Scenario

You are looking to design a database for a school that will house various information from student grades to contact information, class roster lists and attendance. First, think of how you would design such a database. What tables would you include? What columns would each table have? What would be the primary means to join said tables?

## Creating the Database

Now that you've put a little thought into how you might design your database, it's time to go ahead and create it! Start by import the necessary packages. Then, create a database called **school.sqlite**.

In [1]:
# Import necessary packages
import pandas as pd
import sqlite3

In [4]:
# Create the database school.sqlite 
conn = sqlite3.connect('school.sqlite')

## Create a Table for Contact Information

Create a table called contactInfo to house contact information for both students and staff. Be sure to include columns for first name, last name, role (student/staff), telephone number, street, city, state, and zipcode. Be sure to also create a primary key for the table.

In [56]:
# Your code here
cur = conn.cursor()
cur.execute("""
Create table contactInfo
(id Integer PRIMARY KEY,
first_name Text,
last_name Text,
role Text,
telephone_number Text,
street Text,
city Text,
state Text,
zipcode Text);
""")

OperationalError: table contactInfo already exists

## Populate the Table

Below, code is provided for you in order to load a list of dictionaries. Briefly examine the list. Each dictionary in the list will serve as an entry for your contact info table. Once you've briefly investigated the structure of this data, write a for loop to iterate through the list and create an entry in your table for each person's contact info.

In [57]:
# Load the list of dictionaries; just run this cell
import pickle

with open('contact_list.pickle', 'rb') as f:
    contacts = pickle.load(f)
contacts

[{'firstName': 'Christine',
  'lastName': 'Holden',
  'role': 'staff',
  'telephone ': 2035687697,
  'street': '1672 Whitman Court',
  'city': 'Stamford',
  'state': 'CT',
  'zipcode ': '06995'},
 {'firstName': 'Christopher',
  'lastName': 'Warren',
  'role': 'student',
  'telephone ': 2175150957,
  'street': '1935 University Hill Road',
  'city': 'Champaign',
  'state': 'IL',
  'zipcode ': '61938'},
 {'firstName': 'Linda',
  'lastName': 'Jacobson',
  'role': 'staff',
  'telephone ': 4049446441,
  'street': '479 Musgrave Street',
  'city': 'Atlanta',
  'state': 'GA',
  'zipcode ': '30303'},
 {'firstName': 'Andrew',
  'lastName': 'Stepp',
  'role': 'student',
  'telephone ': 7866419252,
  'street': '2981 Lamberts Branch Road',
  'city': 'Hialeah',
  'state': 'Fl',
  'zipcode ': '33012'},
 {'firstName': 'Jane',
  'lastName': 'Evans',
  'role': 'student',
  'telephone ': 3259909290,
  'street': '1461 Briarhill Lane',
  'city': 'Abilene',
  'state': 'TX',
  'zipcode ': '79602'},
 {'firstName': 'Jane',
  'lastName': 'Evans',
  'role': 'student',
  'telephone ': 3259909290,
  'street': '1461 Briarhill Lane',
  'city': 'Abilene',
  'state': 'TX',
  'zipcode ': '79602'},
 {'firstName': 'Mary',
  'lastName': 'Raines',
  'role': 'student',
  'telephone ': 9075772295,
  'street': '3975 Jerry Toth Drive',
  'city': 'Ninilchik',
  'state': 'AK',
  'zipcode ': '99639'},
 {'firstName': 'Ed',
  'lastName': 'Lyman',
  'role': 'student',
  'telephone ': 5179695576,
  'street': '3478 Be Sreet',
  'city': 'Lansing',
  'state': 'MI',
  'zipcode ': '48933'}]

In [58]:
# Iterate over the contact list and populate the contactInfo table here
contacts
# for contact in contacts:
#     firstname = contact['firstName']
#     lastname = contact['lastName']
#     role = contact['role']
#     telephone =contact['telephone ']
#     street = contact['street']
#     city = contact['city']
#     state = contact['state']
#     zipcode = contact['zipcode ']
#     cur.execute("""INSERT INTO contactInfo(first_name,last_name,role,telephone_number,street,city,state,zipcode 
#     ) Values(f'{firstname}',f'{lastname}',f'{role}',f'{telephone}',f'{street}',f'{city}',f'{state}',f'{zipcode}')
#                """)
    

    

    
    
    
for contact in contacts:
    firstname = contact['firstName']
    lastname = contact['lastName']
    role = contact['role']
    telephone =contact['telephone ']
    street = contact['street']
    city = contact['city']
    state = contact['state']
    zipcode = contact['zipcode ']
    cur.execute("""INSERT INTO contactInfo(first_name,last_name,role,telephone_number,street,city,state,zipcode)  
                   VALUES ('{}', '{}', '{}', '{}', '{}', '{}', '{}', '{}');
                """.format(firstname, lastname, role, telephone, street, city, state, zipcode) )

**Query the Table to Ensure it is populated**

In [59]:
# Your code here 
cur.execute("""SELECT *
            FROM contactInfo;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

,id,first_name,last_name,role,telephone_number,street,city,state,zipcode
0,1,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
1,2,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
2,3,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
3,4,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
4,5,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
...,...,...,...,...,...,...,...,...,...
67,68,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
68,69,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
69,70,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
70,71,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
71,72,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

## Commit Your Changes to the Database

Persist your changes by committing them to the database.

In [60]:
# Your code here
conn.commit()

## Create a Table for Student Grades

Create a new table in the database called "grades". In the table, include the following fields: userId, courseId, grade.

** This problem is a bit more tricky and will require a dual key. (A nuance you have yet to see.)
Here's how to do that:

```SQL
CREATE TABLE table_name(
   column_1 INTEGER NOT NULL,
   column_2 INTEGER NOT NULL,
   ...
   PRIMARY KEY(column_1,column_2,...)
);
```

In [61]:
# Create the grades table
cur.execute("""CREATE TABLE grades (userId Integer, courseId Integer, grade Integer,
                Primary Key(userId, courseId));""")

## Remove Duplicate Entries

An analyst just realized that there is a duplicate entry in the contactInfo table! Find and remove it.

In [63]:
# Find the duplicate entry
cur.execute("""SELECT first_name, last_name, telephone_number, Count(*)
                FROM contactInfo
                GRoup by first_name, last_name, telephone_number
                Having count(*)>1;""").fetchall()

[('Andrew', 'Stepp', '7866419252', 4),
 ('Christine', 'Holden', '2035687697', 4),
 ('Christopher', 'Warren', '2175150957', 4),
 ('Ed', 'Lyman', '5179695576', 4),
 ('Jane', 'Evans', '3259909290', 8),
 ('Linda', 'Jacobson', '4049446441', 4),
 ('Mary', 'Raines', '9075772295', 4),
 ('{firstname}', '{lastname}', '{telephone}', 40)]

In [65]:
# Delete the duplicate entry
cur.execute("""DELETE FROM contactInfo
                where first_name = 'Jane';""")

In [66]:
# Check that the duplicate entry was removed
cur.execute("""SELECT first_name, last_name, telephone_number, Count(*)
                FROM contactInfo
                GRoup by first_name, last_name, telephone_number
                Having count(*)>1;""").fetchall()

[('Andrew', 'Stepp', '7866419252', 4),
 ('Christine', 'Holden', '2035687697', 4),
 ('Christopher', 'Warren', '2175150957', 4),
 ('Ed', 'Lyman', '5179695576', 4),
 ('Linda', 'Jacobson', '4049446441', 4),
 ('Mary', 'Raines', '9075772295', 4),
 ('{firstname}', '{lastname}', '{telephone}', 40)]

## Updating an Address

Ed Lyman just moved to `2910 Simpson Avenue York, PA 17403`. Update his address accordingly.

In [67]:
# Update Ed's address
cur.execute("""UPdate contactInfo
                SET street = '2910 Simpson Avenue',
                city = 'York',
                state = 'PA',
                zipcode = '17043'
                WHERE first_name = 'Ed' and last_name ='Lyman';
                """)

In [70]:
# Query the database to ensure the change was made
cur.execute("""SELECT *
            FROM contactInfo;"""
               )
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

,id,first_name,last_name,role,telephone_number,street,city,state,zipcode
0,1,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
1,2,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
2,3,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
3,4,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
4,5,{firstname},{lastname},{role},{telephone},{street},{city},{state},{zipcode}
...,...,...,...,...,...,...,...,...,...
59,66,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
60,67,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
61,68,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
62,71,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
63,72,Ed,Lyman,student,5179695576,2910 Simpson Avenue,York,PA,17043

## Commit Your Changes to the Database

Once again, persist your changes by committing them to the database.

In [71]:
# Your code here
conn.commit()

## Summary

While there's certainly more to do with setting up and managing this database, you got a taste for creating, populating, and maintaining databases! Feel free to continue fleshing out this exercise for more practice.